      * Imprimir texto simples
	IDENTIFICATION DIVISION.
	PROGRAM-ID. OlaMundo.
	AUTHOR. rvsfara.
	PROCEDURE DIVISION.
	DISPLAY "Ola Mundo!".
	STOP RUN.
